
    --[[

        黑市：通用
        大秦军工：军事  *
        惠民企业：民用  **
        巨匠工程：民用  **
        - 焚风：军用    **
        * AI：通用

        - 晓立天下：通用
        暗金教会：通用
        - 莱莎重工：军用    *
        * 闪耀科技：通用

        * 天堂：通用
        索坦：军用      *



        特性列表：

        不屑一顾    ：稀有度强制2
        世所罕见    ：稀有度强制0.999
        寥若晨星    ：稀有度强制0.994         Ps：原神！启动！
        稀有货物    ：稀有度+0.01
        未注册商品  ：稀有度+0.01 + 价值强制为0.1
        大量流通    ：稀有度-0.01
        地下流通    ：稀有度-0.01 + 价值+10%
        量产物品    ：稀有度-0.02 + 价值+20%

        ----[部分系统并没有这个东西]----

        毫无产品质保    ：质保强制为0
        参差不齐的质量  ：减少50%的保底
        优秀的品控      ：拥有额外50%的保底
        完美的品控      ：拥有额外100%的保底

        ----[部分系统并没有这个东西]----

        劣质产品    ：基础值-5% + 价值-5%
        优质产品    ：基础值+5% + 价值+5%
        巨匠工程    ：基础值+5% + 价值+10%

        ----[]----
        遗物            ：价值+200%
        骇人惊闻的价值   ：价值+100%
        昂贵的定价      ：价值+50%
        ----

        模块化      ：普通安装能获取永久安装的80%的性能
        深度激活    ：普通安装获取不到性能，但是永久安装能获取额外5%的性能
        设计缺陷    ：普通安装获取不到性能

        ----

        质量优先  : 能量需求-10%
        优化算法  ：能量需求-5%
        粗劣算法  ：能量需求+5%
        偷工减料  ：能量需求+10%
        超频核心  ：能量需求+10%

        ----

        神秘加密  ：所有数值鉴定为????
        先驱者    ：---
        逆向科技  ：能量需求-5% + 价值+100%

        ---------------
         ----{炮台}----
        ---------------

        火力网络模块    ：永久武装栏位+1
        智能网络模块    ：永久自动栏位+1
        防御网络模块    ：永久防御栏位+1
        密集阵列处理    ：永久自动防御+0.5
        多功能处理器    ：全功能栏位+1

        侵略战斗系统    ：永久武装栏位+2 + 永久自动防御-1
        自动调度系统    ：永久自动栏位+2 + 防御栏位-1
        防御网络阵列    ：永久防御栏位+2 + 自动栏位-1

        并行调度处理器  ：能搭载2个同区域特性

    ]]